CREATE DATABASE  IF NOT EXISTS `recipes_db` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `recipes_db`;
-- MySQL dump 10.13  Distrib 8.0.21, for Win64 (x86_64)
--
-- Host: localhost    Database: recipes_db
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `recipes`
--

DROP TABLE IF EXISTS `recipes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recipes` (
  `id` int NOT NULL AUTO_INCREMENT,
  `parentId` int DEFAULT NULL,
  `name` varchar(100) DEFAULT NULL,
  `description` varchar(10000) DEFAULT NULL,
  `createdDate` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `parentId` (`parentId`),
  CONSTRAINT `recipes_ibfk_1` FOREIGN KEY (`parentId`) REFERENCES `recipes` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recipes`
--

LOCK TABLES `recipes` WRITE;
/*!40000 ALTER TABLE `recipes` DISABLE KEYS */;
INSERT INTO `recipes` VALUES (1,NULL,'БОРЩ ','А чи знаєте ви, що в далекі часи всі українці були практично вегетаріанцями, бо м’яса було досить мало і домашніх свиней кололи лише на свята декілька разів на рік. Тому всі страви були пісними, хіба що зрідка приправлялись смальцем або салом з часником. Цей варіант борщу я знайшов у одному селищі на Поліссі, де зі мною ним поділився один старий. І знаєте, цей рецепт заслуговує на увагу. Бо він такий насичений за смаком та кольором, а ще він такий ароматний, що можна зійти з розуму. Отож цей борщ, як і інші пісні рецепти, неодмінно буде вам до смаку.','2020-07-27 19:18:32'),(2,NULL,'ВИПІЧКА','Саме ароматна випічка здатна не тільки порадувати смакові рецептори, а й подарувати домівці особливу атмосферу затишку. Дім завжди асоціюється з приємними і теплими спогадами, а ще з вишневими булочками або смачною шарлоткою. Звичайно, випічка – не найпростіше, що можна готувати кожен день. Але з іншого боку, пекарі ще десятки років тому примудрялися робити пишну випічку в печах або просто на каменях! І при цьому вона залишалася смачною! А значить, що з сучасними технологіями, зробити бездоганне тісто труднощів не складе.\n\nБезумовно, будь-яка справа має нюанси і тонкощі. Випічка – не виняток. Тісто під час роботи вимагає багато уваги і точності. Але цього абсолютно реально навчитися! І якщо слідувати простим порадам, то створювати кулінарні шедеври не так і складно.','2020-07-27 19:18:32'),(3,1,'ПІСНИЙ БОРЩ','за смаком Сіль та перець\nПІСНИЙ БОРЩ: ПОКРОКОВИЙ РЕЦЕПТ\nПриготуйте бульйон на буряках. Але насправді це просто відвар з буряка. Для цього потрібно почистити буряк (1 шт.), розрізати його навпіл, залити водою і варити 40 хвилин до готовності. Додайте у відвар ½ цибулини і продовжуйте готувати далі.\nКартоплю (3-4 шт.) наріжте дрібними кубиками і відправте до бурякового бульйону.\nПоловину моркви наріжте соломкою і додайте в каструлю до бульйону. Нехай все продовжує варитися.\nПриготуйте засмажку. Для цього болгарський перець (½ шт.) і другу половину цибулини наріжте кубиком і припустіть на пательні з невеликою кількістю рослинної олії до м\'якості протягом 3-5 хвилин. Додайте томатну пасту (2 ст. л.) і протушкуйте ще 2-3 хвилини.\nТепер дістаньте з бульйону буряк, дайте йому трохи охолонути і наріжте довільними шматочками. Він дуже гарячий, тому нарізайте дуже акуратно, щоб не обпектися. Поверніть нарізаний буряк у бульйон і туди ж відправте засмажку.\nЯкщо всі овочі готові, то додайте до борщу квашену капусту з розсолом (200 г). Проваріть 3 хвилини і скуштуйте. Тепер прийшов час довести смак сіллю, перцем та медом (1-2 ст. л.).\nГотовий борщ можна залишити на 20 хвилин, щоб він настоявся і наситився ароматами. А можна відправити в духовку з температурою 180 градусів, щоб він протомився протягом 15-20 хвилин. Подавати можна відразу ж гарячим. Хоча ідеального смаку він набере тільки на наступний день! Народна мудрість.','2020-07-27 19:18:32'),(4,3,'ГЕТЬМАНСЬКИЙ БОРЩ','оли мова заходить про українську кухню, перше, що спливає в нашій пам’яті – це борщ. Мене дещо засмучує цей стан речей, адже українська кухня набагато більш багатогранна і не закінчується на борщі. Однак я повинен визнати, що борщ є візитівкою української кухні і без нього її складно уявити. Саме тому я вирішив приготувати кілька варіантів цієї страви і перший з них – гетьманський борщ. Традиційно його готують зі свинячими ребрами, баклажанами і квасолею. Смак у нього виходить дуже характерним і впізнаваним, адже баклажани дають приємний аромат і солодкість. Якщо ви ще не пробували такий варіант, то саме час його приготувати.','2020-07-27 19:18:32'),(5,3,'ПІСНИЙ БОРЩ ІЗ В’ЯЛЕНОЮ ГРУШЕЮ','Я вже ділився з вами рецептом гетьманського борщу з баклажанами. Але смачний борщ можна приготувати не тільки з м’ясом. Без нього він виходить нітрохи не гірше, а якщо взяти один секретний інгредієнт смак стає просто дивовижним. Мені подобається готувати пісний борщ з в’яленої грушею. Ви не уявляєте, скільки смаку можна отримати з цього невеликого зморщився плода і наскільки він ідеально доповнює  український борщ. Якщо ви до цих пір не пробували це поєднання, то обов’язково приготуйте борщ за цим рецептом.','2020-07-27 19:18:32'),(6,2,'ПАСКА','Рецепт приготування паски завжди викликає величезний інтерес. Щороку ми намагаємося знайти якийсь новий цікавий рецепт цієї великодньої випічки. У цьому році я вирішив не винаходити велосипед і приготувати дріжджову паску за класичним рецептом, який, звичайно, трохи видозмінив і полегшив. Для приготування я використовував живі дріжджі «Духмяна хата», які ідеально підходять для будь-якої випічки. Результатом я залишився дуже задоволений, і тому хочу поділитися з вами рецептом цієї ароматної дріжджової паски','2020-07-27 19:18:32'),(7,2,'СИРНА ЗАПІКАНКА','Сирна запіканка – така ніжна і повітряна, яка змусить вас подивитися на цей кулінарний шедевр абсолютно по-іншому. Звичайно ж, це буде коштувати вам певних зусиль і чітких слідувань моїм інструкціям, але результат точно вас здивує. Спробуйте, і ви закохаєтесь у цей рецепт назавжди, обіцяю!','2020-07-27 19:18:32'),(8,2,'М’ЯСНИЙ ПИРІГ З ТЕМНИМ ПИВОМ','Це дуже простий м’ясний пиріг, приготування якого не потребує  багато зусиль. У ньому все досить просто, а результат виходить просто приголомшливий. Яловичина відмінно поєднується з темним пивом, яке додає м’ясу приємний карамельний смак і робить його дуже ніжним. М’ясний пиріг з темним пивом відмінний варіант для сімейної вечері або для прийому гостей.','2020-07-27 19:18:32'),(9,1,'ЗЕЛЕНИЙ БОРЩ ЗІ ШПИНАТОМ','Мене завжди дивувала назва цієї страви. Чому саме борщ, а не просто зелений суп? Але якщо не вдаватися в термінологію, хочу сказати, що зелений борщ – найкращий суп із зелені, який тільки можна собі уявити. Дуже легкий і, в той же час, насичений за смаком. Я рекомендую приготувати його на овочевому бульйоні, взявши в якості зелені листя шпинату, петрушки і зелену цибулю.','2020-07-27 19:18:32');
/*!40000 ALTER TABLE `recipes` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-07-28 10:36:20
